package Homework1;

public class Homework5 {
    public static void main(String[] args) {
        System.out.println("Here are numbers 1-100 ASC:");
        for (int i = 1; i <=100; i++) {
            System.out.println(i);
        }
        System.out.println("Here are numbers 100-1 DESC:");
        for (int i = 100; i >=1; i--) {
            System.out.println(i);
        }
    }
    /*Задача 5:
Да се изведат числата от 1 до 100 във възходящ и в низходящ ред
и да се отпечатат получените резултати с помоща на for цикъл*/
}
