package Homework2;

import java.util.Arrays;

public class Homework6 {
    public static void main(String[] args) {
        int[] firstArr = {1, 2, 3};
        int[] secondArr = {1, 2, 3};

        if (Arrays.equals(firstArr, secondArr)) {
            System.out.println("Arrays are equal");
        } else {
            System.out.println("Arrays are not equal");
        }
    }
    /*Задача 6
Дадени са два масива със стойности {1, 2, 3} и {1, 2, 3} да се състави програма,
която проверява дали масивите са еднакви*/
}
